SiliconLabs/sdk_support/platform/Device/SiliconLabs/EFR32FG23/Include/efr32fg23b020f512gm40.h
/* Part number capabilities */
#define ACMP_PRESENT                                         /** ACMP is available in this part */
#define ACMP_COUNT                                         2 /** 2 ACMPs available  */
#define AGC_PRESENT                                          /** AGC is available in this part */
#define AGC_COUNT                                          1 /** 1 AGCs available  */
#define AMUXCP_PRESENT                                       /** AMUXCP is available in this part */
#define AMUXCP_COUNT                                       1 /** 1 AMUXCPs available  */
#define BUFC_PRESENT                                         /** BUFC is available in this part */
#define BUFC_COUNT                                         1 /** 1 BUFCs available  */
#define BURAM_PRESENT                                        /** BURAM is available in this part */
#define BURAM_COUNT                                        1 /** 1 BURAMs available  */
#define BURTC_PRESENT                                        /** BURTC is available in this part */
#define BURTC_COUNT                                        1 /** 1 BURTCs available  */
#define CMU_PRESENT                                          /** CMU is available in this part */
#define CMU_COUNT                                          1 /** 1 CMUs available  */
#define DCDC_PRESENT                                         /** DCDC is available in this part */
#define DCDC_COUNT                                         1 /** 1 DCDCs available  */
#define DMEM_PRESENT                                         /** DMEM is available in this part */
#define DMEM_COUNT                                         1 /** 1 DMEMs available  */
#define DPLL_PRESENT                                         /** DPLL is available in this part */
#define DPLL_COUNT                                         1 /** 1 DPLLs available  */
#define ECAIFADC_PRESENT                                     /** ECAIFADC is available in this part */
#define ECAIFADC_COUNT                                     1 /** 1 ECAIFADCs available  */
#define EMU_PRESENT                                          /** EMU is available in this part */
#define EMU_COUNT                                          1 /** 1 EMUs available  */
#define EUSART_PRESENT                                       /** EUSART is available in this part */
#define EUSART_COUNT                                       3 /** 3 EUSARTs available  */
#define FRC_PRESENT                                          /** FRC is available in this part */
#define FRC_COUNT                                          1 /** 1 FRCs available  */
#define FSRCO_PRESENT                                        /** FSRCO is available in this part */
#define FSRCO_COUNT                                        1 /** 1 FSRCOs available  */
#define GPCRC_PRESENT                                        /** GPCRC is available in this part */
#define GPCRC_COUNT                                        1 /** 1 GPCRCs available  */
#define GPIO_PRESENT                                         /** GPIO is available in this part */
#define GPIO_COUNT                                         1 /** 1 GPIOs available  */
#define HFRCO_PRESENT                                        /** HFRCO is available in this part */
#define HFRCO_COUNT                                        1 /** 1 HFRCOs available  */
#define HFRCOEM23_PRESENT                                    /** HFRCOEM23 is available in this part */
#define HFRCOEM23_COUNT                                    1 /** 1 HFRCOEM23s available  */
#define HFXO_PRESENT                                         /** HFXO is available in this part */
#define HFXO_COUNT                                         1 /** 1 HFXOs available  */
#define HOSTMAILBOX_PRESENT                                  /** HOSTMAILBOX is available in this part */
#define HOSTMAILBOX_COUNT                                  1 /** 1 HOSTMAILBOXs available  */
#define I2C_PRESENT                                          /** I2C is available in this part */
#define I2C_COUNT                                          2 /** 2 I2Cs available  */
#define IADC_PRESENT                                         /** IADC is available in this part */
#define IADC_COUNT                                         1 /** 1 IADCs available  */
#define ICACHE_PRESENT                                       /** ICACHE is available in this part */
#define ICACHE_COUNT                                       1 /** 1 ICACHEs available  */
#define KEYSCAN_PRESENT                                      /** KEYSCAN is available in this part */
#define KEYSCAN_COUNT                                      1 /** 1 KEYSCANs available  */
#define LCD_PRESENT                                          /** LCD is available in this part */
#define LCD_COUNT                                          1 /** 1 LCDs available  */
#define LCDRF_PRESENT                                        /** LCDRF is available in this part */
#define LCDRF_COUNT                                        1 /** 1 LCDRFs available  */
#define LDMA_PRESENT                                         /** LDMA is available in this part */
#define LDMA_COUNT                                         1 /** 1 LDMAs available  */
#define LDMAXBAR_PRESENT                                     /** LDMAXBAR is available in this part */
#define LDMAXBAR_COUNT                                     1 /** 1 LDMAXBARs available  */
#define LESENSE_PRESENT                                      /** LESENSE is available in this part */
#define LESENSE_COUNT                                      1 /** 1 LESENSEs available  */
#define LETIMER_PRESENT                                      /** LETIMER is available in this part */
#define LETIMER_COUNT                                      1 /** 1 LETIMERs available  */
#define LFRCO_PRESENT                                        /** LFRCO is available in this part */
#define LFRCO_COUNT                                        1 /** 1 LFRCOs available  */
#define LFXO_PRESENT                                         /** LFXO is available in this part */
#define LFXO_COUNT                                         1 /** 1 LFXOs available  */
#define MODEM_PRESENT                                        /** MODEM is available in this part */
#define MODEM_COUNT                                        1 /** 1 MODEMs available  */
#define MSC_PRESENT                                          /** MSC is available in this part */
#define MSC_COUNT                                          1 /** 1 MSCs available  */
#define PCNT_PRESENT                                         /** PCNT is available in this part */
#define PCNT_COUNT                                         1 /** 1 PCNTs available  */
#define PFMXPPRF_PRESENT                                     /** PFMXPPRF is available in this part */
#define PFMXPPRF_COUNT                                     1 /** 1 PFMXPPRFs available  */
#define PROTIMER_PRESENT                                     /** PROTIMER is available in this part */
#define PROTIMER_COUNT                                     1 /** 1 PROTIMERs available  */
#define PRS_PRESENT                                          /** PRS is available in this part */
#define PRS_COUNT                                          1 /** 1 PRSs available  */
#define RAC_PRESENT                                          /** RAC is available in this part */
#define RAC_COUNT                                          1 /** 1 RACs available  */
#define RADIOAES_PRESENT                                     /** RADIOAES is available in this part */
#define RADIOAES_COUNT                                     1 /** 1 RADIOAESs available  */
#define RFCRC_PRESENT                                        /** RFCRC is available in this part */
#define RFCRC_COUNT                                        1 /** 1 RFCRCs available  */
#define RFECA_PRESENT                                        /** RFECA is available in this part */
#define RFECA_COUNT                                        2 /** 2 RFECAs available  */
#define RFMAILBOX_PRESENT                                    /** RFMAILBOX is available in this part */
#define RFMAILBOX_COUNT                                    1 /** 1 RFMAILBOXs available  */
#define RFSCRATCHPAD_PRESENT                                 /** RFSCRATCHPAD is available in this part */
#define RFSCRATCHPAD_COUNT                                 1 /** 1 RFSCRATCHPADs available  */
#define SCRATCHPAD_PRESENT                                   /** SCRATCHPAD is available in this part */
#define SCRATCHPAD_COUNT                                   1 /** 1 SCRATCHPADs available  */
#define SEMAILBOX_PRESENT                                    /** SEMAILBOX is available in this part */
#define SEMAILBOX_COUNT                                    1 /** 1 SEMAILBOXs available  */
#define SMU_PRESENT                                          /** SMU is available in this part */
#define SMU_COUNT                                          1 /** 1 SMUs available  */
#define SYNTH_PRESENT                                        /** SYNTH is available in this part */
#define SYNTH_COUNT                                        1 /** 1 SYNTHs available  */
#define SYSCFG_PRESENT                                       /** SYSCFG is available in this part */
#define SYSCFG_COUNT                                       1 /** 1 SYSCFGs available  */
#define SYSRTC_PRESENT                                       /** SYSRTC is available in this part */
#define SYSRTC_COUNT                                       1 /** 1 SYSRTCs available  */
#define TIMER_PRESENT                                        /** TIMER is available in this part */
#define TIMER_COUNT                                        5 /** 5 TIMERs available  */
#define ULFRCO_PRESENT                                       /** ULFRCO is available in this part */
#define ULFRCO_COUNT                                       1 /** 1 ULFRCOs available  */
#define USART_PRESENT                                        /** USART is available in this part */
#define USART_COUNT                                        1 /** 1 USARTs available  */
#define VDAC_PRESENT                                         /** VDAC is available in this part */
#define VDAC_COUNT                                         1 /** 1 VDACs available  */
#define WDOG_PRESENT                                         /** WDOG is available in this part */
#define WDOG_COUNT                                         2 /** 2 WDOGs available  */
#define DEVINFO_PRESENT                                      /** DEVINFO is available in this part */
#define DEVINFO_COUNT                                      1 /** 1 DEVINFOs available  */

/* Include standard ARM headers for the core */
#include "core_cm33.h"        /* Core Header File */
#include "system_efr32fg23.h" /* System Header File */

/** @} End of group EFR32FG23B020F512GM40_Part */

/**************************************************************************//**
 * @defgroup EFR32FG23B020F512GM40_Peripheral_TypeDefs EFR32FG23B020F512GM40 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 *****************************************************************************/
#include "efr32fg23_scratchpad.h"
#include "efr32fg23_emu.h"
#include "efr32fg23_cmu.h"
#include "efr32fg23_hfrco.h"
#include "efr32fg23_fsrco.h"
#include "efr32fg23_dpll.h"
#include "efr32fg23_lfxo.h"
#include "efr32fg23_lfrco.h"
#include "efr32fg23_ulfrco.h"
#include "efr32fg23_msc.h"
#include "efr32fg23_icache.h"
#include "efr32fg23_prs.h"
#include "efr32fg23_gpio.h"
#include "efr32fg23_ldma.h"
#include "efr32fg23_ldmaxbar.h"
#include "efr32fg23_timer.h"
#include "efr32fg23_usart.h"
#include "efr32fg23_burtc.h"
#include "efr32fg23_i2c.h"
#include "efr32fg23_syscfg.h"
#include "efr32fg23_buram.h"
#include "efr32fg23_gpcrc.h"
#include "efr32fg23_dcdc.h"
#include "efr32fg23_mailbox.h"
#include "efr32fg23_eusart.h"
#include "efr32fg23_sysrtc.h"
#include "efr32fg23_lcd.h"
#include "efr32fg23_keyscan.h"
#include "efr32fg23_mpahbram.h"
#include "efr32fg23_lcdrf.h"
#include "efr32fg23_pfmxpprf.h"
#include "efr32fg23_aes.h"
#include "efr32fg23_smu.h"
#include "efr32fg23_letimer.h"
#include "efr32fg23_iadc.h"
#include "efr32fg23_acmp.h"
#include "efr32fg23_amuxcp.h"
#include "efr32fg23_vdac.h"
#include "efr32fg23_pcnt.h"
#include "efr32fg23_lesense.h"
#include "efr32fg23_hfxo.h"
#include "efr32fg23_wdog.h"
#include "efr32fg23_semailbox.h"
#include "efr32fg23_frc.h"
#include "efr32fg23_agc.h"
#include "efr32fg23_rfcrc.h"
#include "efr32fg23_modem.h"
#include "efr32fg23_synth.h"
#include "efr32fg23_protimer.h"
#include "efr32fg23_rac.h"
#include "efr32fg23_eca.h"
#include "efr32fg23_ecaifadc.h"
#include "efr32fg23_bufc.h"
#include "efr32fg23_devinfo.h"

/* Custom headers for LDMAXBAR and PRS mappings */
#include "efr32fg23_prs_signals.h"
#include "efr32fg23_dma_descriptor.h"
#include "efr32fg23_ldmaxbar_defines.h"

/** @} End of group EFR32FG23B020F512GM40_Peripheral_TypeDefs  */

/**************************************************************************//**
 * @defgroup EFR32FG23B020F512GM40_Peripheral_Base EFR32FG23B020F512GM40 Peripheral Memory Map
 * @{
 *****************************************************************************/

