SiliconLabs/sdk_support/platform/Device/SiliconLabs/EFR32FG23/Include/efr32fg23b020f512gm40.h
#define RDMEM_SEQ_RAMECCADDR_WIDTH              0x20UL      /**> SEQ RAM ECC Address width */
#define RDMEM_SEQ_RAM_BWE_WIDTH                 0x27UL      /**> SEQRAM BWE width */
#define RDMEM_SEQ_RAM_DATA_WIDTH                0x27UL      /**> SEQ_RAM_DATA_WIDTH */
#define RDMEM_SEQ_RAM_ECC_EN                    0x1UL       /**> SEQ RAM ECCEN */
#define FRC_DEMOD_FILT_WIDTH                    0x13UL      /**> New Param */
#define FRC_FCD_NUM                             0x4UL       /**> None */
#define FRC_INTELEMENTS                         0x10UL      /**> None */
#define FRC_RAMADDR_WIDTH                       0x20UL      /**> None */
#define AGC_AMPLITUDE_WIDTH                     0x14UL      /**> New Param */
#define AGC_POWER_WIDTH                         0xCUL       /**> New Param */
#define MODEM_ADDR_WIDTH                        0xBUL       /**> New Param */
#define MODEM_AMPLITUDE_WIDTH                   0x14UL      /**> New Param */
#define MODEM_ANT_NUM                           0x2UL       /**> Antenna Number */
#define MODEM_DEC0_SIZE                         0xFUL       /**> New Param */
#define MODEM_DEMOD_RAM_WIDTH                   0xAUL       /**> New Param */
#define MODEM_DEMOD_WIDTH                       0x8UL       /**> New Param */
#define MODEM_INTERNAL_SIZE                     0x13UL      /**> New Param */
#define MODEM_IN_SIZE                           0x8UL       /**> New Param */
#define MODEM_LEADING_BITS_SIZE                 0x4UL       /**> New Param */
#define MODEM_PHASE_SIZE                        0x8UL       /**> New Param */
#define MODEM_POWER_WIDTH                       0xCUL       /**> New Param */
#define MODEM_RAM_SIZE                          0x100UL     /**> New Param */
#define MODEM_REMOVE_BCR                        0x0UL       /**> New Param */
#define MODEM_REMOVE_COH_DEMOD                  0x0UL       /**> New Param */
#define MODEM_REMOVE_DEMOD_FILTER               0x0UL       /**> New Param */
#define MODEM_REMOVE_IQDSA                      0x1UL       /**> New Param */
#define MODEM_REMOVE_LRBLE                      0x1UL       /**> New Param */
#define MODEM_SYMBOL_WIDTH                      0x4UL       /**> New Param */
#define SYNTH_CHPDACBITS                        0x8UL       /**>  */
#define SYNTH_DACDEMBITS                        0x3UL       /**>  */
#define SYNTH_MMDDENOMBITS                      0x9UL       /**>  */
#define SYNTH_MODEM_AFCADJ_WIDTH                0x13UL      /**>  */
#define SYNTH_MOD_OUT_WIDTH                     0x11UL      /**>  */
#define SYNTH_ZERO_IF_RECEIVER                  0x0UL       /**>  */
#define PROTIMER_CC_NUM                         0x8UL       /**> None */
#define PROTIMER_PRS_NUM                        0xBUL       /**>  */
#define RAC_DIAGABLK_WIDTH                      0x7UL       /**> None */
#define RAC_DIAGATP_WIDTH                       0x6UL       /**> None */
#define RAC_DPI_CHAN_COUNT                      0x6UL       /**>  */
#define RAC_PRESC_BITS                          0x7UL       /**> None */
#define RAC_WAIT_BITS                           0xAUL       /**> None */
#define RFMAILBOX_NUM_MSGPTRS                   0x4UL       /**>  */
#define RFECA0_BUF_NUM                          0x2UL       /**> Number of Memory Buffers */
#define RFECA1_BUF_NUM                          0x2UL       /**> Number of Memory Buffers */
#define ECAIFADC_FIFO_SIZE                      0x4UL       /**> FIFO size */
#define BUFC_LOG2NUMOFBUFS                      0x2UL       /**> New Param */
#define BUFC_LOG2NUMOFINPUTS                    0x1UL       /**> New Param */
#define BUFC_NUMOFBUFS                          0x4UL       /**> New Param */
#define BUFC_NUMOFINPUTS                        0x1UL       /**> New Param */

/* Instance macros for ACMP */
#define ACMP(n)                         (((n) == 0) ? ACMP0   \
                                         : ((n) == 1) ? ACMP1 \
                                         : 0x0UL)
#define ACMP_NUM(ref)                   (((ref) == ACMP0) ? 0   \
                                         : ((ref) == ACMP1) ? 1 \
                                         : -1)
#define ACMP_DAC_INPUT(n)               (((n) == 0) ? ACMP0_DAC_INPUT   \
                                         : ((n) == 1) ? ACMP1_DAC_INPUT \
                                         : 0x0UL)
#define ACMP_EXT_OVR_IF(n)              (((n) == 0) ? ACMP0_EXT_OVR_IF   \
                                         : ((n) == 1) ? ACMP1_EXT_OVR_IF \
                                         : 0x0UL)

/* Instance macros for ECA */
#define ECA(n)                          (((n) == 0) ? RFECA0   \
                                         : ((n) == 1) ? RFECA1 \
                                         : 0x0UL)
#define ECA_NUM(ref)                    (((ref) == RFECA0) ? 0   \
                                         : ((ref) == RFECA1) ? 1 \
                                         : -1)
#define ECA_BUF_NUM(n)                  (((n) == 0) ? RFECA0_BUF_NUM   \
                                         : ((n) == 1) ? RFECA1_BUF_NUM \
                                         : 0x0UL)

/* Instance macros for EUSART */
#define EUSART(n)                       (((n) == 0) ? EUSART0   \
                                         : ((n) == 1) ? EUSART1 \
                                         : ((n) == 2) ? EUSART2 \
                                         : 0x0UL)
#define EUSART_NUM(ref)                 (((ref) == EUSART0) ? 0   \
                                         : ((ref) == EUSART1) ? 1 \
                                         : ((ref) == EUSART2) ? 2 \
                                         : -1)
#define EUSART_EM2_CAPABLE(n)           (((n) == 0) ? EUSART0_EM2_CAPABLE   \
                                         : ((n) == 1) ? EUSART1_EM2_CAPABLE \
                                         : ((n) == 2) ? EUSART2_EM2_CAPABLE \
                                         : 0x0UL)
#define EUSART_NOT_EM2_CAPABLE(n)       (((n) == 0) ? EUSART0_NOT_EM2_CAPABLE   \
                                         : ((n) == 1) ? EUSART1_NOT_EM2_CAPABLE \
                                         : ((n) == 2) ? EUSART2_NOT_EM2_CAPABLE \
                                         : 0x0UL)

/* Instance macros for HFRCO */
#define HFRCO(n)                        (((n) == 0) ? HFRCO0      \
                                         : ((n) == 1) ? HFRCOEM23 \
                                         : 0x0UL)
#define HFRCO_NUM(ref)                  (((ref) == HFRCO0) ? 0      \
                                         : ((ref) == HFRCOEM23) ? 1 \
                                         : -1)
#define HFRCO_EM23ONDEMAND(n)           (((n) == 0) ? HFRCO0_EM23ONDEMAND      \
                                         : ((n) == 1) ? HFRCOEM23_EM23ONDEMAND \
                                         : 0x0UL)
#define HFRCO_EXCLUDEEM23ONDEMAND(n)    (((n) == 0) ? HFRCO0_EXCLUDEEM23ONDEMAND      \
                                         : ((n) == 1) ? HFRCOEM23_EXCLUDEEM23ONDEMAND \
                                         : 0x0UL)

